# Напишите рекурсивную функцию sum(a, b), возвращающую сумму двух целых неотрицательных чисел. 
# Из всех арифметических операций допускаются только +1 и -1. Также нельзя использовать циклы.


def sum(a, b):
    if a == 0:
        return b
    elif b == 0:
        return a
    else:
        return sum(a - 1, b + 1)

# Получаем ввод от пользователя
a = int(input("Введите первое число: "))
b = int(input("Введите второе число: "))

# Вызываем функцию для получения суммы
result = sum(a, b)

# Выводим результат
print("Сумма:", result)
